"use strict";
// 1 Дан массив с числами. Переберите этот массив циклом и возведите каждый элемент этого массива в квадрат.

let arr = [1, 2, 3, 4, 5];
for (let i = 0; i < arr.length; i++){
  arr[i] *= 2;
}
console.log(arr);

// 2 Дан массив с числами. Переберите этот массив циклом и отнимите от каждого элемента единицу.

let arr2 = [1, 2, 3, 45, 12];
for (let i = 0; i <arr2.length; i++){
  arr2[i]--;
}console.log(arr2);

// 3 Дан массив с числами. Переберите этот массив циклом и прибавьте к каждому элементу 10.

let arr3 = [1, 2, 3, 45, 12];
for (let i = 0; i <arr3.length; i++){
  arr3[i] += 10;
}console.log(arr3);