"use strict";

// 1 Код должен вывести элемент объекта:

let obj = {x: 1, y: 2, z: 3};
console.log(obj['x']);

// добавила '' к иксу тк без них мы обращаемся как к переменной, а в данном случае обращение идет в ключу объекта

// 2 Код должен вывести элемент объекта по ключу из переменной:

let obj2 = {x: 1, y: 2, z: 3};
let key = 'x';
console.log(obj2[key]);

// добавила [] к переменной key тк данном случае обращение идет как раз к переменной в которую записан ключ объекта

// 3 Код должен вывести сумму элементов объекта:

let obj3 = {x: 1, y: 2, z: 3};
let sum = obj3['x'] + obj3['y'] + obj3['x'];

console.log(sum);

// добавила '' при обращении к ключу (как в 1 задании),  в консоль вывожу переменную sum, тк к ней будет храниться результат

// 4 Код должен вывести количество элементов объекта:

let obj4 = {x: 1, y: 2, z: 3};
console.log(Object.keys(obj).length);

// В данном случае код выведет "undefined", так как объект не имеет свойства "length". Для подсчета количества элементов в объекте можно использовать метод Object.keys(obj).length, который вернет количество ключей в объекте.