"use strict";

// №1 Найдите количество секунд в сутках
alert(60*60*24);

// 2 Найдите количество секунд в 30 сутках.
alert(60*60*24*30);

// 3 Найдите количество секунд в году.
alert(60*60*24*365);

// 4 Найдите количество минут в сутках.
alert(60*24);

// 5 Найдите количество минут в году.
alert(60*24*365);

// 6 Найдите количество байт в мегабайте.
alert(1024 * 1024);

// 7 Найдите количество байт в гигабайте.
alert(1024 * 1024 * 1024);

// 8 Найдите количество байт в 10 гигабайтах.
alert(1024 * 1024 * 1024 * 10);

// 9 Найдите количество байт в терабайте.
alert(1024 * 1024 * 1024 * 1024);

// 10 Найдите количество килобайт в терабайте. (чтобы найти количество килобайт в терабайте, нужно разделить количество байт в терабайте на количество байт в килобайте)
  
alert(1099511627776 / 1024);


