"use strict";
// 1 Что выведется в консоль в результате выполнения следующего кода:
function func(num) {
	return num;
	let res = num ** 2;
	return res;
}
console.log(func(3));
// 3, потому что после выполнения оператора return функция завершает свою работу и дальнейший код не выполняется. В данном случае, первый оператор return завершает функцию и возвращает значение переменной num, игнорируя последующий код.


// 2 Что выведется в консоль результате выполнения следующего кода:
function func(num) {
	if (num <= 0) {
		return Math.abs(num);
	} else {
		return num ** 2;
	}
}
console.log( func(10) ); // будет 100 тк число положительное и сработал 2й ретёрн
console.log(func(-5)); // будет 5 тк. число меньше 0 сработает первый ретёрн и выведет модуль числа

// 3  
function func(num) {
	if (num <= 0) {
		return Math.abs(num);
	}
	return num ** 2;
}
console.log( func(10) );
console.log( func(-5) ); // то же самое что и в прошлом задании