"use strict";
// 1 С помощью цикла создайте объект, ключами которого будут названия дней, а значениями - их номера.
let obj = {};
let arr1 = ['пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс'];
let arr2 = [1, 2, 3, 4, 5, 6, 7];

for (let i = 0; i < arr1.length; i++) {
  obj[arr1[i]] = arr2[i];
}
console.log(obj);


// 2 Переберите этот объект циклом и запишите в новый объект те элементы, которые являются четными числами.
let obj2 = {a: 1, b: 2, c: 3, d: 4, e: 5};
let newobj = {};
for (let key in obj2) {
  if (obj2[key] % 2 === 0) {
    newobj[key] = obj2[key];
  }
}
console.log(newobj); 

// 3 Переберите этот объект циклом и создайте новый объект так, чтобы его ключами стали элементы старого объекта, а значениями - ключи старого объекта.
let obj3 = {a: 1, b: 2, c: 3, d: 4, e: 5};
let neww = {};
for (let j in obj3){
  neww[obj3[j]] = j; //присваивает новое свойство neww с ключом, который является значением из объекта obj3, и значением, которое является переменной j
}
console.log(neww);

