"use strict";
// 1 Дана строка '1-2-3-4-5'. С помощью метода split запишите каждое число этой строки в отдельный элемент массива. 
let one = '1-2-3-4-5';
let arr = [];
arr = one.split('-');
console.log(arr);

// 2 Дана строка '12345'. С помощью метода split запишите каждый символ этой строки в отдельный элемент массива.
let two = '12345';
let arr2 = two.split('');
console.log(arr2);

// 3 С помощью метода join слейте его в строку '1-2-3-4-5'.
let three = [1, 2, 3, 4, 5];
let str = three.join('-');
console.log(str);