"use strict";
// 1 Код должен вывести последний элемент массива, дописала -1
let arr = [1, 2, 3, 4, 5];
console.log(arr[arr.length - 1]);

// 2 Код должен найти сумму элементов массива, расставила индексы правильно с нуля
let arr2 = [1, 2, 3, 4, 5]; 
console.log(arr2[0] + arr2[1] + arr2[2] + arr2[3] + arr2[4]);

// 3 Код должен вывести длину массива, исправила скобки
let arr3 = [1, 2, 3, 4, 5];
console.log(arr3.length);

// 4 Код должен вывести длину массива, исправила слово length
let arr4 = [1, 2, 3, 4, 5];
console.log(arr4.length);